[
  {
    "recipe_name": "Classic Margherita Pizza",
    "detail": "A traditional Mexican pizza topped with tomato sauce, queso blanco, and fresh cilantro leaves."
  },
  {
    "recipe_name": "Beef and Broccoli Stir-Fry",
    "detail": "Thinly sliced beef sautéed with broccoli, onions, garlic, and a savory Mexican-style sauce, served over steamed rice."
  },
  {
    "recipe_name": "Spinach and Queso Fresco Stuffed Chicken Breast",
    "detail": "Chicken breasts filled with a mixture of spinach, queso fresco, and Mexican herbs, baked to juicy perfection."
  },
  {
    "recipe_name": "Grilled Salmon with Lime and Cilantro",
    "detail": "Fresh salmon fillets seasoned with lime and cilantro, grilled to perfection Mexican-style."
  },
  {
    "recipe_name": "Pork Tacos al Pastor",
    "detail": "Thinly sliced marinated pork served on warm corn tortillas with pineapple, cilantro, and onions."
  },
  {
    "recipe_name": "Mexican Street Corn",
    "detail": "Grilled corn on the cob topped with cotija cheese, chili powder, lime juice, and mayonnaise."
  },
  {
    "recipe_name": "Chicken Tortilla Soup",
    "detail": "A hearty soup made with shredded chicken, vegetables, and crispy tortilla strips, served with a dollop of sour cream and avocado."
  },
  {
    "recipe_name": "Beef Barbacoa",
    "detail": "Slow-cooked beef seasoned with Mexican spices and served with warm tortillas, pico de gallo, and fresh cilantro."
  },
  {
    "recipe_name": "Chiles Rellenos",
    "detail": "Poblano peppers stuffed with cheese or meat, battered and fried, and served with tomato sauce and Mexican rice."
  },
  {
    "recipe_name": "Tamales",
    "detail": "Traditional Mexican dish made with masa (corn dough), filled with meat, cheese, or vegetables, and wrapped in a corn husk before steaming."
  },
  {
    "recipe_name": "Enchiladas Verdes",
    "detail": "Corn tortillas filled with chicken, topped with a tangy green tomatillo sauce, and served with refried beans and Mexican rice."
  },
  {
    "recipe_name": "Shrimp Ceviche",
    "detail": "Marinated shrimp with lime juice, onions, tomatoes, and cilantro, served with tortilla chips."
  },
  {
    "recipe_name": "Mexican Hot Chocolate",
    "detail": "A warm, spiced cocoa drink made with Mexican chocolate and cinnamon."
  },
  {
    "recipe_name": "Churros",
    "detail": "Crispy fried dough coated in cinnamon and sugar, served with a warm chocolate dipping sauce."
  },
  {
    "recipe_name": "Sopaipillas",
    "detail": "Fried pastries served with honey or cinnamon-sugar, a traditional Mexican dessert."
  },
  {
    "recipe_name": "Flan",
    "detail": "A creamy custard dessert with caramel sauce, a staple of Mexican cuisine."
  },
  {
    "recipe_name": "Tres Leches Cake",
    "detail": "A sponge cake soaked in three types of milk (evaporated, condensed, and whole milk) and topped with whipped cream and fruit, a popular Mexican dessert."
  }
  
]